Tekla.Structures.Model.Operations.Operation.ReportParameters
Represents the parameters required for generating a report.
Remarks: This class encapsulates various settings and options that define how a report is
generated, including template names, file names, titles, and processing flags. It provides properties to
specify whether the report is generated from selected objects or all objects, and allows customization of
the report's appearance and format.

Tekla.Structures.Model.Operations.Operation.ReportParameters.IsFromSelected
Gets or sets a value indicating whether the report is from selected or from all objects.

Tekla.Structures.Model.Operations.Operation.ReportParameters.TemplateName
Gets or sets the name of the report template to be used in report creation. The name must contain more than three characters.

Tekla.Structures.Model.Operations.Operation.ReportParameters.FileName
Gets or sets the name of the created report. The name must contain more than three characters.

Tekla.Structures.Model.Operations.Operation.ReportParameters.XLTXFileName
Gets or sets the name of the Excel template to be used.

Tekla.Structures.Model.Operations.Operation.ReportParameters.Title1
Gets or sets the first title for the created report.

Tekla.Structures.Model.Operations.Operation.ReportParameters.Title2
Gets or sets the second title for the created report.

Tekla.Structures.Model.Operations.Operation.ReportParameters.Title3
Gets or sets the third title for the created report.

Tekla.Structures.Model.Operations.Operation.ReportParameters.XLSXFlags
Gets or sets the flags used for processing XLSX files.